20210907103240-reward_driven_optimal_vehicle_longitudinal_decision.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>reward-driven optimal vehicle longitudinal decision</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">reward-driven optimal vehicle longitudinal decision</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0fed098">comparison</a>
<ul>
<li><a href="#org01f5f5a">基于深度强化学习的混动列车的能量管理方法及系统 （2020）</a>
<ul>
<li><a href="#org5e6ea39">区别</a></li>
<li><a href="#org6a12bc4">相似</a></li>
</ul>
</li>
<li><a href="#org0f5f1ff">基于 QoE 的个性化自动驾驶参数优化设定方法（2014）</a>
<ul>
<li><a href="#orga185ab5">不同</a></li>
<li><a href="#org4a17f27">相似</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       38694c8a-c239-4a09-8a9a-5deeaffa0212
</p>


<div id="outline-container-org0fed098" class="outline-2">
<h2 id="org0fed098">comparison</h2>
<div class="outline-text-2" id="text-org0fed098">
</div>
<div id="outline-container-org01f5f5a" class="outline-3">
<h3 id="org01f5f5a">基于深度强化学习的混动列车的能量管理方法及系统 （2020）</h3>
<div class="outline-text-3" id="text-org01f5f5a">
</div>
<div id="outline-container-org5e6ea39" class="outline-4">
<h4 id="org5e6ea39">区别</h4>
<div class="outline-text-4" id="text-org5e6ea39">
</div>
<ul class="org-ul">
<li><a id="org881e5a9"></a>混动<br /></li>
<li><a id="orgfea5679"></a>列车<br /></li>
<li><a id="orgb17d012"></a>仿真<br />
<ul class="org-ul">
<li><a id="org18d88f8"></a>需要建立动力仿真模型<br /></li>
<li><a id="orgd484f9e"></a>我们不需要建立模型，是无模型方法，本质上从大数据中提取更新复杂模型<br /></li>
<li><a id="org9424378"></a>基于仿真<br /></li>
</ul>
</li>
<li><a id="org43a7812"></a>离线训练<br />
<ul class="org-ul">
<li><a id="orge9d01a8"></a>非闭环控制，非动态控制<br />
<ul class="org-ul">
<li><a id="orge28b469"></a>离线用仿真模型训练，得到应用静态策略<br /></li>
</ul>
</li>
<li><a id="org3ff3e96"></a>训练使用仿真的数据，而不是真实车辆行驶数据，没有使用车辆真实行驶数据进行训练，<br /></li>
<li><a id="orgd7c47b3"></a>能量管理策略在真实环境中运行的性能和效果主要依赖于仿真模型的精度，而不是依赖于大数据，<br /></li>
<li><a id="org3fe4c58"></a>本质上不是基于大数据的方法<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org6a12bc4" class="outline-4">
<h4 id="org6a12bc4">相似</h4>
<div class="outline-text-4" id="text-org6a12bc4">
</div>
<ul class="org-ul">
<li><a id="org807c063"></a>源数据相当于观测量，有车速，加速度，电池电量，没有人员操作，没有电压电流值<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org0f5f1ff" class="outline-3">
<h3 id="org0f5f1ff">基于 QoE 的个性化自动驾驶参数优化设定方法（2014）</h3>
<div class="outline-text-3" id="text-org0f5f1ff">
</div>
<div id="outline-container-orga185ab5" class="outline-4">
<h4 id="orga185ab5">不同</h4>
<div class="outline-text-4" id="text-orga185ab5">
</div>
<ul class="org-ul">
<li><a id="org6d1987a"></a>场景离散划分，需要场景识别模块，且场景参数化是离散分段的，而不是连续的。<br />
<ul class="org-ul">
<li><a id="org3623dca"></a>我们不对场景进行参数化描述和存取<br /></li>
</ul>
</li>
<li><a id="org141b286"></a>没有使用深度学习和强化学习，是典型的老方法，无法规模化。<br />
<ul class="org-ul">
<li><a id="org24e90d9"></a>参数化后使用 K-Means 等传统聚类方法进行参数匹配，需要人为设定一些关键参数，比如场景聚类个数，我们不需要。<br /></li>
<li><a id="orgd06aee6"></a>最佳参数的选择因为场景是离散化的，实际上并不是最佳的。<br /></li>
<li><a id="orgb7b1e7b"></a>随着数据的增加，场景复杂度增加，原有的关键参数必然会失效，就导致性能下降。<br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org4a17f27" class="outline-4">
<h4 id="org4a17f27">相似</h4>
<div class="outline-text-4" id="text-org4a17f27">
</div>
<ul class="org-ul">
<li><a id="org2146386"></a>云端：数据存在云端，数据以静态方式按车辆型号和离散的场景分类存取<br /></li>
<li><a id="org2a2828d"></a>最佳参数选择是静态匹配方式<br /></li>
<li><a id="orgde97ff9"></a>云端数据静态存储管理，无有效处理大数据的方法，<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
